# Import Modules

In [1]:
import pandas as pd
print(pd.__version__)

1.3.4

In [8]:
d={'team':['DC','Marvel'],
  'Heroes':[['Batman','Superman','Wonderwomen','Aquaman','Grenn Lantern','Shazam'],
  ['Iron Man','Captain America','Ant-man','Black Panther','Captain Marvel']]}

df =pd.DataFrame(d)
df

     team                                             Heroes
0      DC  [Batman, Superman, Wonderwomen, Aquaman, Grenn...
1  Marvel  [Iron Man, Captain America, Ant-man, Black Pan...

# Explode

In [10]:
df1=df.explode('Heroes')
df1

     team           Heroes
0      DC           Batman
0      DC         Superman
0      DC      Wonderwomen
0      DC          Aquaman
0      DC    Grenn Lantern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

# Implode

In [11]:
d={'Team':['DC','Marvel']}
df2 =pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [12]:
df2['implode']=df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                            implode
0      DC  [Batman, Superman, Wonderwomen, Aquaman, Grenn...
1  Marvel  [Iron Man, Captain America, Ant-man, Black Pan...